{
    "leads": [
        {
            "username": "Fickle-Reality7777",
            "platform": "Reddit",
            "text": "Talk to me about CRM options I own a small service based business. We do about $3MM. \n\nWe have regular accounts and one-off ‘jobs’ as well (about 500/year)\n\nRight now, client calls or emails, we send proposal, we book. It’s all done through a combination of email and excel. \n\nI’m debating trying out a CRM platform just to streamline the process and see details like who took a call, if my partner has emailed back yet or sent a proposal etc. \n\nDoes this sound like a good use case for CRM? Is it just a glorified database in my case? \n\nLooking for input from other small business owners. ",
            "time": "2025-02-10T09:44:38",
            "match": 90,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1ilxm17/talk_to_me_about_crm_options/"
        },
        {
            "username": "Lopsided_Echo_8673",
            "platform": "Reddit",
            "text": "Which CRM makes your life easier — and why? I've tried a few different CRM platforms and still can't settle on a favorite. Do you use one that actually makes your life easier? Which CRM and why? If you've got pros, cons, or any killer features to share, I'd love to hear them! Feel free to drop your recommendations and war stories below.",
            "time": "2025-01-12T18:33:41",
            "match": 92,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1hzm7rt/which_crm_makes_your_life_easier_and_why/"
        },
        {
            "username": "jibberishballr",
            "platform": "Reddit",
            "text": "Best option a crm? Looking at options for my friend's service business. \n\nHe wants to capture leads via a form and provide instant quotes based on critiera captured from the cudtokers in the form, then allow them to sign up for services. \n\nHe also wants to capture leads via calls to the business and over email (maybe Facebook too). \n\nHe needs basic invoicing and will have recurring customers. He'll need their addresses and payment methods stored. \n\nIt'd be great to have some ai to handle leads as well (E. G. If he's doing the service work when leads come in). \n\nSuggestions on any all in one's or a combo of things that would help his business meet these goals? ? ",
            "time": "2025-03-15T03:33:44",
            "match": 94,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1jbfo9n/best_option_a_crm/"
        },
        {
            "username": "Zealousideal-Egg5161",
            "platform": "Reddit",
            "text": "Event Coordinator CRM Hello all, I am a newer event/wedding coordinator and am looking for the best CRM to use. I have purchased office 365 for my business and am obviously are starting very small. I have read many mixed reviews on Honeybook, and Co-Pilot even seems to be a CRM. \n\nPlease send over reccomendations. I want something that is great for the clients and an all in one platform.  ",
            "time": "2025-03-05T23:17:51",
            "match": 96,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1j490as/event_coordinator_crm/"
        },
        {
            "username": "No_Hovercraft7735",
            "platform": "Reddit",
            "text": "CRM recommendations? I'm looking for a CRM that has good analytics reports. Almost all my leads come from cold outreach, and I'm specifically looking for a program that can help me track email open rates across different subject lines and click rates with different email bodies for optimization. I've been using HubSpot $20 per month plan, but the jump to the next level is $800 per month. Any recommendations? Looking to stay as cheap as possible",
            "time": "2025-03-17T22:00:22",
            "match": 98,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1jdgwma/crm_recommendations/"
        }
    ],
    "competitor_complaints": [
        {
            "username": "astrolean",
            "platform": "Reddit",
            "text": "What’s one piece of software you refuse to use, no matter how popular it is? Some tools seem to be everywhere, but for whatever reason, they just don’t work for you. Maybe the UI is a nightmare, the pricing is ridiculous, or it’s just overhyped. Curious what’s that one tool everyone swears by, but you wouldn’t touch with a ten foot pole And what made you swear it off?",
            "time": "2025-03-14T19:50:17",
            "match": 90,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1jb50iu/whats_one_piece_of_software_you_refuse_to_use_no/"
        },
        {
            "username": "ImpossibleBell4759",
            "platform": "Reddit",
            "text": "The \"AI Agent\" Hype is out of control and businesses suffer  Ah, the sweet smell of AI hype in the morning. Nothing quite like it to get the blood pumping and the venture capital flowing.\n\nLet's cut through the BS... The \"AI Agent\" craze is the tech industry's latest attempt to separate businesses from their hard-earned cash.\n\nIt's like watching a bunch of sheep rushing towards a cliff, except the cliff is made of overpriced software and empty promises.\n\nThe tech giants are having a field day with this nonsense. Microsoft, Google, Salesforce - they're all pushing AI agents like they're the second coming.\n\nThe sad truth is, businesses are suffering from a severe case of FOMO (Fear of Missing Out).\n\nThey're so terrified of being left behind in the AI race that they're willing to throw good money after bad.\n\nHere's a radical idea: how about focusing on actual business problems instead of chasing the latest tech fad? I know, I know, it's not as sexy as having an AI Agent, but it might actually, you know, work.\n\nIn the end, the only ones truly benefiting from this AI agent hype are the vendors selling the snake oil and the consultants charging exorbitant fees to implement it.\n\nEveryone else is just along for the ride, hoping they don't crash and burn too spectacularly.\n\nSo, to all the businesses out there considering jumping on the AI Agent bandwagon... take a step back, take a deep breath, and ask yourself if you really need an overpriced chatbot with delusions of grandeur. Chances are, you don't.\n\nThe AI agent hype is like a bad reality TV show—overproduced, lacking substance, and leaving businesses with nothing but regret.\n\nCompanies are throwing money at AI solutions, expecting miracles, only to find they've bought into overpriced fantasies.\n\nThe AI agent hype is nothing more than a high-tech emperor with no clothes. It's time for businesses to wake up, smell the silicon, and start making decisions based on reality rather than sci-fi fantasies. \n\nI think AI Agents are the future, but as of right now AI Agents aren't autonomous or agentic.\n\nFrom what I've seen as of now is glorified Chatbots, ChatGPT wrappers and basic automations, and nothing actually autonomous.\n\nSo far it's all just hype, but we'll see how it improves businesses and the bottom line!\n\nHow do you think AI Agents will help small businesses now or in the future?",
            "time": "2025-01-17T21:17:59",
            "match": 92,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1i3japd/the_ai_agent_hype_is_out_of_control_and/"
        }
    ],
    "company_complaints": [
        {
            "username": "FitHappensPT",
            "platform": "Reddit",
            "text": "Zoom vs Hubspot vs ActiveCampaign? I'm finally taking the time to research and establish systems and automation to make the whole lead gen and nurture process a bit smoother and less overwhelming.  I've been researching the platforms listed in the title for a while now and have done some trials but most of them have limitations on the trial. Specifically the limitations are in actually building (not running just building) SMS campaigns.  For example I tried in Zoho and without paying I couldn't even see the simplest of functions, like is it possible for an automated reply to a YES response.  All of that to say I'm just looking for some feedback from experience on the 3 platforms.\n\nBelow are some basic needs:\n- Forms or landing pages to collect leads (though I could work around this if the rest of the platform is amazing)\n- Ability to create conditional campaigns that include SMS and email.  Conditional meaning a small variety of responses based on how the lead replies or interacts with the campaign\n- obviously within that, the ability to send Swiths well as email\n- within the SMS specifically I would like the ability to craft at least a couple different auto-responses depending on simply replies like 'Yes', 'No', 'Option 1', etc\n- personalizations based on lead form selections beyond just their name, so the ability to auto-populate their selected goal to personalize their sequence a bit and put them in different sequences based on the selected goal\n- very basic CRM, my business is small so I don't need a robust CRM, just a bit more functionality than a spreadsheet or Notion template\n- ability to send manual messages as needed\n\nAnd as a note like I said my business is small as is our lead flow.  We are not getting thousands of leads a month, and rarely more than 100. We do want some capacity to increase that without astronomical fees but our structure is such that we would likely never need to see more than a few hundred leads per month. If it ever even approached 1000/mo we would be able to easily afford a high priced system.\n\nI know that was a lot of info, maybe more than anyone needs but I appreciate any input from experience on using these platforms to help me make a decision here.",
            "time": "2024-11-13T21:58:03",
            "match": 90,
            "connect_url": "https://www.reddit.com/r/smallbusiness/comments/1gqgulu/zoom_vs_hubspot_vs_activecampaign/"
        },
        {
            "username": "steve_33",
            "platform": "Reddit",
            "text": "Hubspot for sales CRM, marketing outreach, and service desk? I've worked at startups where we used multiple different tools. Sales, marketing, and customer support each had their own system. I always found it to be a pain. Practically speaking, when sales wants to phone up a customer they need to see if the customer had submitted any support tickets and they want to know how many e-mails they have received from marketing. And the same need for visibility exists in other departments. So practically speaking, every person needs access to every system and it just becomes inefficient.\n\nSo now that I am starting my own company, I was hoping to use a single tool. My preference is to choose a CRM on day one that will be good enough for the first five years so I don't lose early conversations and never have to deal with a migration.\n\nI've looked at a few options including Salesforce and Zoho. I get the impression Salesforce is going to be overly complex for what I need (simple SaaS business) and expensive to set up. Zoho sounds neat on paper but I see some negative commentary online and I worry about whether all the apps will work well together. Hubspot seems like a great compromise. Has anyone had any luck using this as their one-stop solution for support tickets, sales CRM and for marketing outreach?\n\n  \n",
            "time": "2024-09-27T23:45:08",
            "match": 92,
            "connect_url": "https://www.reddit.com/r/Entrepreneur/comments/1fqua8m/hubspot_for_sales_crm_marketing_outreach_and/"
        }
    ]
}